Tekla Open API Reference for Tekla Structures 2025
SaveLoad Events
The SaveLoad type exposes the following members.
Events
Name | Description
AttributesLoadClicked
 The AttributesLoadClicked event is triggered just after the load button has been clicked.
AttributesLoaded
 The AttributesLoaded event is triggered just after attributes have been loaded into the dialog.
AttributesSaveAsClicked
 The AttributesSaveAsClicked event is triggered just after the save as button has been clicked.
AttributesSaveClicked
 The AttributesSaveClicked event is triggered just after the save button has been clicked.
AttributesSaved
 The AttributesSaved event is triggered just after attributes are saved to a file.
AttributesSavedAs
 The AttributesSavedAs event is triggered just after attributes are "saved as" to a file.
HelpOpenClicked
 The HelpOpenClicked event is triggered just after the help button has been clicked.
HelpOpened
 The HelpOpened event is triggered just after the help file is opened.
Top
See Also
Reference
SaveLoad Class
Tekla.Structures.Dialog.UIControls Namespace